tutorials/channelOodles/channel395/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Ubar            Ubar [0 1 -1 0 0 0 0] (0.1335 0 0);

transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 2e-05;

CrossPowerLawCoeffs
{
    nu0             nu0 [0 2 -1 0 0 0 0] 1e-06;
    nuInf           nuInf [0 2 -1 0 0 0 0] 1e-06;
    m               m [0 0 1 0 0 0 0] 1;
    n               n [0 0 0 0 0 0 0] 1;
}

BirdCarreauCoeffs
{
    nu0             nu0 [0 2 -1 0 0 0 0] 1e-06;
    nuInf           nuInf [0 2 -1 0 0 0 0] 1e-06;
    k               k [0 0 1 0 0 0 0] 0;
    n               n [0 0 0 0 0 0 0] 1;
}


// ************************************************************************* //
